{
    "id": "plan-a942251e-bb56-47d1-8ee1-80728f73d56d",
    "plan_context": {
        "query": "Topic:William Morris\nFind a video about this topic and use its transcript to compose a short learning note, ensuring the note is written as one paragraph. The note should include information describing the key topics covered and should avoid information from the transcript that isn't related to the topic. Write the summary and the URL onto a new page on Notion. Make sure to include the URL.",
        "tool_ids": [
            "calculator_tool",
            "find_video_tool",
            "notion_pageadd_tool",
            "search_tool",
            "weather_tool"
        ]
    },
    "steps": [
        {
            "task": "Find a video about the topic 'William Morris' by searching for a YouTube video that provides a transcript and URL related to the topic 'William Morris'.",
            "inputs": [],
            "tool_id": "find_video_tool",
            "output": "$video_info",
            "condition": null
        },
        {
            "task": "Compose a short learning note from the video's transcript obtained in the previous step. The note should be written as one paragraph, include key topics covered from the transcript, only include information related to 'William Morris', and integrate the video URL. Use the transcript and URL provided by the previous step as basis for this composition.",
            "inputs": [
                {
                    "name": "$video_info",
                    "description": "Video transcript and URL about William Morris"
                }
            ],
            "tool_id": "llm_tool",
            "output": "$learning_note",
            "condition": null
        },
        {
            "task": "Create a new page on Notion where the page name indicates a learning note on 'William Morris' and the page contents are the composed learning note from the previous step, ensuring the included URL is part of the note.",
            "inputs": [
                {
                    "name": "$learning_note",
                    "description": "The composed learning note summary including key topics from the transcript and the video URL"
                }
            ],
            "tool_id": "notion_pageadd_tool",
            "output": "$notion_page",
            "condition": null
        }
    ]
}